def tst():
    x = 0

    while True:
        x += 1
        print(x)
        if x == 15:
            return x

def tst1():

    def ret_bool():
        return False, False

    if ret_bool():
        print(True)
    else:
        print(False)


def tst3():
    l = ['Apple', 'Banana', 'Berry', 'Cherry']
    for i in l:
        if i in ['Banana', 'Berry']:
            l.remove(i)
    print(l)

import re
import datetime
def tst4():
    a1 = 'Луна / Deo mun (The Moon) / 202 3 / ДБ, СТ / WEB-DL (1080p)'
    print('/' in a1)

    a2 = 'Луна  Deo mun (The Moon) 2023 ДБ, СТ'
    removed_spaces = re.sub(r'\s+', ' ', a2)
    b = [element.strip() for element in removed_spaces.split(' ')]
    print(' '.join(b[:5]))

    match = re.search(r'\d{4}', a1)
    if match:
        year = str(match.group())
    else:
        year = str(datetime.now().year)
    print(year)


def solver(M, изделия):
  # Вычисляем общий тираж изделий
  общий_тираж = sum(изделия.values())

  # Вычисляем пропорцию каждого изделия на листе
  пропорции = {товар: количество / общий_тираж for товар, количество in изделия.items()}

  # Вычисляем оптимальное количество каждого изделия на листе
  распределение = {товар: max(1, round(пропорции[товар] * M)) for товар in изделия}

  # Пересчитываем общий тираж
  общий_тираж = sum(распределение.values())

  # Выравниваем, если необходимо, чтобы общий тираж был равен M
  разница = M - общий_тираж
  # Распределяем разницу равномерно между всеми товарами
  for товар in распределение:
      дополнение = round(пропорции[товар] * разница)
      распределение[товар] += дополнение
      # Если после добавления дополнения у нас все равно ноль, то добавим единицу
      if распределение[товар] == 0:
          распределение[товар] = 1

  return распределение, M


def tst5():
    # Пример использования
    M = 25
    items = {'apple': 1000, 'banana': 2000, 'lemon': 500}

    оптимальное_распределение, общий_тираж = solver(M, items)

    листов_для_изделия = []
    for товар, количество_на_листе in оптимальное_распределение.items():
        требуемое_количество_листов = items[товар] / количество_на_листе
        листов_для_изделия = [требуемое_количество_листов]
    тираж = max(листов_для_изделия)

    print(f"Общий тираж изделий: {общий_тираж}")
    print(f"Тираж листов: {тираж}")
    print("Оптимальное распределение на листе:")
    for товар, количество_на_листе in оптимальное_распределение.items():
        print(f"{товар}: {количество_на_листе} штук, нужно {items[товар]}, напечатано: {количество_на_листе * тираж}")


if __name__ == '__main__':
    tst5()
